#include <stdio.h>
#include <signal.h>
#include <unistd.h>
#ifdef PTHREADS
#include <pthread.h>
#endif
#ifdef MPI
#include <mpi.h>
#include "auto_mpi.h"
#endif
#include <string.h>

#ifndef __AUTO_C_H__
#define __AUTO_C_H__

#define NPARX (36) /*get rid of*/
#define NBIFX (20)
#define KREDO (1)          /*get rid of*/
#define NPARX2 (NPARX * 2) /*get rid of*/
#define HMACH (1.0e-7)
#define RSMALL (1.0e-30)
#define RLARGE (1.0e+30)
#define HMACH1 (HMACH + 1.0e0)
#define M1SB (NBIFX)
#define LEFT (1)
#define RIGHT (2)
#define QZMATZ (.FALSE.)
#define QZEPS1 (0.0E0)
#define HMACHHO (1.0e-13)

extern FILE *fp2;
extern FILE *fp3;
extern FILE *fp7;
extern FILE *fp8;
extern FILE *fp9;
extern FILE *fp10;
extern FILE *fp12;

#define CONPAR_DEFAULT 0
#define CONPAR_PTHREADS 1
#define CONPAR_MPI 2
#define SETUBV_DEFAULT 0
#define SETUBV_PTHREADS 1
#define SETUBV_MPI 2

extern int global_conpar_type;
extern int global_setubv_type;
extern int global_num_procs;
extern int global_verbose_flag;

typedef struct {
    /* 1 */ integer ndim;
    /* 2 */ integer ips;
    /* 3 */ integer irs;
    /* 4 */ integer ilp;
    /* 5 */ integer ntst;
    /* 6 */ integer ncol;
    /* 7 */ integer iad;
    /* 8 */ integer iads;
    /* 9 */ integer isp;
    /* 10 */ integer isw;
    /* 11 */ integer iplt;
    /* 12 */ integer nbc;
    /* 13 */ integer nint;
    /* 14 */ integer nmx;
    /* 15 */ integer nuzr;
    /* 16 */ integer npr;
    /* 17 */ integer mxbf;
    /* 18 */ integer iid;
    /* 19 */ integer itmx;
    /* 20 */ integer itnw;
    /* 21 */ integer nwtn;
    /* 22 */ integer jac;
    /* 23 */ integer ndm;
    /* 24 */ integer nbc0;
    /* 25 */ integer nnt0;
    /* 26 */ integer iuzr;
    /* 27 */ integer itp;
    /* 28 */ integer itpst;
    /* 29 */ integer nfpr;
    /* 30 */ integer ibr;
    /* 31 */ integer nit;
    /* 32 */ integer ntot;
    /* 33 */ integer nins;
    /* 34 */ integer istop;
    /* 35 */ integer nbif;
    /* 36 */ integer ipos;
    /* 37 */ integer lab;
    /* 41 */ integer nicp;
    /* The following are not set in init_.
       They have to do with the old parallel version. */
    /* 38 */ integer mynode;
    /* 39 */ integer numnodes;
    /* 40 */ integer parallel_flag;
} iap_type;

typedef struct {
    /* 1 */ double ds;
    /* 2 */ double dsmin;
    /* 3 */ double dsmax;
    /* There is no 4 */
    /* 5 */ double dsold;
    /* 6 */ double rl0;
    /* 7 */ double rl1;
    /* 8 */ double a0;
    /* 9 */ double a1;
    /* 10 */ double amp;
    /* 11 */ double epsl;
    /* 12 */ double epsu;
    /* 13 */ double epss;
    /* 14 */ double det;
    /* 15 */ double tivp;
    /* 16 */ double fldf;
    /* 17 */ double hbff;
    /* 18 */ double biff;
    /* 19 */ double spbf;
} rap_type;

/*This is the type for all functions which can be used as "funi" the function
  which evaluates the right hand side of the equations and generates
  the Jacobian*/
#define FUNI_TYPE(X)                                                           \
    int X(const iap_type *iap, const rap_type *rap, integer ndim,              \
          const double *u, const double *uold, const integer *icp,     \
          double *par, integer ijac, double *f, double *dfdu,      \
          double *dfdp)

/*This is the type for all functions which can be used as "bcni" the function
  which evaluates the boundary conditions */
#define BCNI_TYPE(X)                                                           \
    int X(const iap_type *iap, const rap_type *rap, integer ndim,              \
          double *par, const integer *icp, integer nbc,                    \
          const double *u0, const double *u1, double *f,           \
          integer ijac, double *dbc)
