#include <stdio.h>
#include <signal.h>
#include <unistd.h>
#ifdef PTHREADS
#include <pthread.h>
#endif
#ifdef MPI
#include <mpi.h>
#include "auto_mpi.h"
#endif
#include <string.h>

#ifndef __AUTO_C_H__
#define __AUTO_C_H__

#define NPARX (36) /*get rid of*/
#define NBIFX (20)
#define KREDO (1)          /*get rid of*/
#define NPARX2 (NPARX * 2) /*get rid of*/
#define HMACH (1.0e-7)
#define RSMALL (1.0e-30)
#define RLARGE (1.0e+30)
#define HMACH1 (HMACH + 1.0e0)
#define M1SB (NBIFX)
#define LEFT (1)
#define RIGHT (2)
#define QZMATZ (.FALSE.)
#define QZEPS1 (0.0E0)
#define HMACHHO (1.0e-13)

extern FILE *fp2;
extern FILE *fp3;
extern FILE *fp7;
extern FILE *fp8;
extern FILE *fp9;
extern FILE *fp10;
extern FILE *fp12;

#define CONPAR_DEFAULT 0
#define CONPAR_PTHREADS 1
#define CONPAR_MPI 2
#define SETUBV_DEFAULT 0
#define SETUBV_PTHREADS 1
#define SETUBV_MPI 2

extern int global_conpar_type;
extern int global_setubv_type;
extern int global_num_procs;
extern int global_verbose_flag;

typedef struct {
    /* 1 */ int64 ndim;
    /* 2 */ int64 ips;
    /* 3 */ int64 irs;
    /* 4 */ int64 ilp;
    /* 5 */ int64 ntst;
    /* 6 */ int64 ncol;
    /* 7 */ int64 iad;
    /* 8 */ int64 iads;
    /* 9 */ int64 isp;
    /* 10 */ int64 isw;
    /* 11 */ int64 iplt;
    /* 12 */ int64 nbc;
    /* 13 */ int64 nint;
    /* 14 */ int64 nmx;
    /* 15 */ int64 nuzr;
    /* 16 */ int64 npr;
    /* 17 */ int64 mxbf;
    /* 18 */ int64 iid;
    /* 19 */ int64 itmx;
    /* 20 */ int64 itnw;
    /* 21 */ int64 nwtn;
    /* 22 */ int64 jac;
    /* 23 */ int64 ndm;
    /* 24 */ int64 nbc0;
    /* 25 */ int64 nnt0;
    /* 26 */ int64 iuzr;
    /* 27 */ int64 itp;
    /* 28 */ int64 itpst;
    /* 29 */ int64 nfpr;
    /* 30 */ int64 ibr;
    /* 31 */ int64 nit;
    /* 32 */ int64 ntot;
    /* 33 */ int64 nins;
    /* 34 */ int64 istop;
    /* 35 */ int64 nbif;
    /* 36 */ int64 ipos;
    /* 37 */ int64 lab;
    /* 41 */ int64 nicp;
    /* The following are not set in init_.
       They have to do with the old parallel version. */
    /* 38 */ int64 mynode;
    /* 39 */ int64 numnodes;
    /* 40 */ int64 parallel_flag;
} iap_type;

typedef struct {
    /* 1 */ double ds;
    /* 2 */ double dsmin;
    /* 3 */ double dsmax;
    /* There is no 4 */
    /* 5 */ double dsold;
    /* 6 */ double rl0;
    /* 7 */ double rl1;
    /* 8 */ double a0;
    /* 9 */ double a1;
    /* 10 */ double amp;
    /* 11 */ double epsl;
    /* 12 */ double epsu;
    /* 13 */ double epss;
    /* 14 */ double det;
    /* 15 */ double tivp;
    /* 16 */ double fldf;
    /* 17 */ double hbff;
    /* 18 */ double biff;
    /* 19 */ double spbf;
} rap_type;

/*This is the type for all functions which can be used as "funi" the function
  which evaluates the right hand side of the equations and generates
  the Jacobian*/
#define FUNI_TYPE(X)                                                           \
    int X(const iap_type *iap, const rap_type *rap, int64 ndim,                \
          const double *u, const double *uold, const int64 *icp, double *par,  \
          int64 ijac, double *f, double *dfdu, double *dfdp)

/*This is the type for all functions which can be used as "bcni" the function
  which evaluates the boundary conditions */
#define BCNI_TYPE(X)                                                           \
    int X(const iap_type *iap, const rap_type *rap, int64 ndim, double *par,   \
          const int64 *icp, int64 nbc, const double *u0, const double *u1,     \
          double *f, int64 ijac, double *dbc)

/*This is the type for all functions which can be used as "icni" the function
